"""
함수 안의 변수 / 밖의 변수

로컬 변수란? 
함수 내에서만 사용하는 변수

글로벌 변수란?
함수 내, 외 둘다 사용 가능한 변수
특정 함수에서 출력된 결과를 다른 함수에서 이용할 때 사용한다.

함수 안의 변수와 밖의 변수가 서로 이름이 같다해도, 전혀 다른 변수이다.
만약 같은 변수로 취급하려면 Global변수로 선언해야 한다.


"""

def scope_test():
    a = 1          # 로컬 변수
    print('a :{0}'.format(a) )

scope_test()         # a : 1

a= 0                 # a = 0으로 선언  /  글로벌 변수

scope_test()         # a : 1     함수 속 a는 함수 내에서만 사용가능한 변수이기 때문.

print('문제 152. 위 스크립트에서 마지막 scope_test를 실행했을때 a가 1이 아닌, 0으로 출력되려면  함수를 생성할때 어떻게 했어야 하는가?')'


def scope_test():
    global a    # a라는 변수는 글로벌 변수라며 선언 !! 여기다 선언 한번 하면 전역변수 a값이 어떤게 생겨도 무조건 1이 될 수밖에 없도록 됨. ㅈ됨.
    print(a)
    a = 1
    print('a :{0}'.format(a) )

a = 0

a = 5
scope_test()
print('a:{0}'.format(a))

